app/Validation/UsuarioReglas.php

  public function validateEmailUsuario(string $str, string $fields, array $data){

    $id_usuario = (int) $fields;
    $model = new UsuarioModel();

    $user = $model->where('email', $data['tbx_email_usuario']);
    $user = ($id_usuario != 0) ?  $user->where('id_usuario !=', $id_usuario) : $user;
    $user = $user->first();
---
SELECT *
FROM "t_usuarios"
WHERE "email" = 'william.calderon@stps.gob.mx'
AND "id_usuario" != 1
 LIMIT 1