app/Controllers/UsuarioController.php

SELECT *
FROM "t_usuarios"
WHERE "t_usuarios"."id_usuario" = '1'
---
    function ObtenerUsuario($id_usuario)
    {
        header('Content-Type: application/json');

        $usuario = [];

        if ($id_usuario > 0) {
            $usuario =  $this->miUsuarioModel->find($id_usuario);

UPDATE "t_usuarios" SET "nombre_usuario" = 'WILLIAM', "apellido_paterno" = 'CALDERON', "apellido_materno" = 'PALOMINO', "email" = 'william.calderon@stps.gob.mx', "telefono" = '5532202731', "estatus_usuario" = '1', "role" = 'admin', "id_ur" = '60', "id_sede" = '1'
WHERE "t_usuarios"."id_usuario" IN ('1')
---
        ];

        if ($id_usuario != 0) {
            $this->miUsuarioModel->update($id_usuario, $DatosUsuario);

SELECT *
FROM "cat_sedes"
---
    public function ModalAgregarActualizar($id_usuario)
    {
        if ($id_usuario != 0) {
            $accion = 'Guardar';
            $datos['URs'] = $this->miURModel->findAll();
            $datos['Sedes'] = $this->miSedeModel->findAll();