app/Models/UsuarioModel.php

    public function getDatosUsuarios($id_ur = -1, $estatus_usuario = -1)
    {
        $datos = $this->select('ROW_NUMBER () OVER (ORDER BY t_usuarios.id_usuario) as row, t_usuarios.*, cat_ur.nombre_ur, cat_sedes.sede_nombre')
                      ->join('cat_ur', 'cat_ur.id_ur = t_usuarios.id_ur')
                      ->join('cat_sedes', 't_usuarios.id_sede = cat_sedes.id_sede' );

        $datos = ($id_ur != -1) ? $this->where('t_usuarios.id_ur', $id_ur) : $datos;
        $datos = ($estatus_usuario != -1) ? $this->where('t_usuarios.estatus_usuario', $estatus_usuario) : $datos;

        $datos = $this->orderBy('t_usuarios.id_usuario', 'ASC')
                      ->findAll();
---
SELECT ROW_NUMBER () OVER (ORDER BY t_usuarios.id_usuario) as row, "t_usuarios".*, "cat_ur"."nombre_ur", "cat_sedes"."sede_nombre"
FROM "t_usuarios"
JOIN "cat_ur" ON "cat_ur"."id_ur" = "t_usuarios"."id_ur"
JOIN "cat_sedes" ON "t_usuarios"."id_sede" = "cat_sedes"."id_sede"
WHERE "t_usuarios"."estatus_usuario" = '1'
ORDER BY "t_usuarios"."id_usuario" ASC